veryaner/esp8266-multi-sensor/src/web/webserver.cpp
        server.send(200, "application/json", response); });

    server.on("/api/config", HTTP_POST, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        String body = server.arg("plain");
        DynamicJsonDocument doc(512);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            server.send(400, "application/json", "{\"error\": \"Invalid JSON\"}");
            return;
        }
        
        bool configChanged = false;
        
        // Update MQTT settings
        if (doc.containsKey("mqtt_broker")) {
            strlcpy(config.mqtt_broker, doc["mqtt_broker"], sizeof(config.mqtt_broker));
            configChanged = true;
        }
        if (doc.containsKey("mqtt_port")) {
            config.mqtt_port = doc["mqtt_port"];
            configChanged = true;
        }
        if (doc.containsKey("mqtt_username")) {
            strlcpy(config.mqtt_username, doc["mqtt_username"], sizeof(config.mqtt_username));
            configChanged = true;
        }
        if (doc.containsKey("mqtt_password")) {
            strlcpy(config.mqtt_password, doc["mqtt_password"], sizeof(config.mqtt_password));
            configChanged = true;
        }
        if (doc.containsKey("mqtt_enabled")) {
            config.mqtt_enabled = doc["mqtt_enabled"];
            configChanged = true;
        }
        
        // Update device settings
        if (doc.containsKey("location")) {
            strlcpy(config.location, doc["location"], sizeof(config.location));
            configChanged = true;
        }
        if (doc.containsKey("sensorless_mode")) {
            config.sensorless_mode = doc["sensorless_mode"];
            configChanged = true;
        }
        if (doc.containsKey("use_radar")) {
            config.use_radar = doc["use_radar"];
            configChanged = true;
        }
        
        if (configChanged) {
            saveConfig();
            DynamicJsonDocument responseDoc(128);
            responseDoc["message"] = "Configuration updated successfully";
            responseDoc["timestamp"] = millis();
            
            String response;
            serializeJson(responseDoc, response);
            server.send(200, "application/json", response);
        } else {
            server.send(400, "application/json", "{\"error\": \"No valid configuration parameters provided\"}");
        } });

    // Export full configuration including pin assignments
    server.on("/api/config/full", HTTP_GET, []()
              {
        DynamicJsonDocument doc(2048);
        
        // Current configuration
        doc["mqtt_broker"] = config.mqtt_broker;
        doc["mqtt_port"] = config.mqtt_port;
        doc["mqtt_username"] = config.mqtt_username;
        doc["location"] = config.location;
        doc["mqtt_enabled"] = config.mqtt_enabled;
        doc["sensorless_mode"] = config.sensorless_mode;
        doc["use_radar"] = config.use_radar;
        
        // Pin assignments
        doc["pins"]["dht11"] = DHT_PIN;
        doc["pins"]["pir"] = PIR_PIN;
        doc["pins"]["led"] = LED_PIN;
        doc["pins"]["sda"] = SDA_PIN;
        doc["pins"]["scl"] = SCL_PIN;
        
        // System information
        doc["system"]["device_hostname"] = deviceHostname; // Use MDNS.hostname() for the actual hostname
        doc["system"]["wifi_ssid"] = WIFI_SSID;
        doc["system"]["wifi_password"] = WIFI_PASSWORD;
        doc["system"]["ap_ip"] = AP_IP;
        
        // Timing configuration
        doc["timing"]["sensor_read_interval"] = SENSOR_READ_INTERVAL;
        doc["timing"]["mqtt_publish_interval"] = MQTT_PUBLISH_INTERVAL;
        doc["timing"]["pir_cooldown"] = PIR_COOLDOWN;
        doc["timing"]["ota_check_interval"] = OTA_CHECK_INTERVAL;
        
        // MQTT topics
        doc["mqtt_topics"]["temperature"] = MQTT_TOPIC_TEMPERATURE;
        doc["mqtt_topics"]["humidity"] = MQTT_TOPIC_HUMIDITY;
        doc["mqtt_topics"]["motion"] = MQTT_TOPIC_MOTION;
        doc["mqtt_topics"]["luminescence"] = MQTT_TOPIC_LUMINESCENCE;
        doc["mqtt_topics"]["status"] = MQTT_TOPIC_STATUS;
        doc["mqtt_topics"]["all"] = MQTT_TOPIC_ALL;
        
        String response;
        serializeJson(doc, response);
        
        server.send(200, "application/json", response); });

    // Export configuration to file
    server.on("/api/config/export", HTTP_GET, []()
              {
        DynamicJsonDocument doc(2048);
        
        // Current configuration
        doc["mqtt_broker"] = config.mqtt_broker;
        doc["mqtt_port"] = config.mqtt_port;
        doc["mqtt_username"] = config.mqtt_username;
        doc["mqtt_password"] = config.mqtt_password;
        doc["location"] = config.location;
        doc["mqtt_enabled"] = config.mqtt_enabled;
        doc["sensorless_mode"] = config.sensorless_mode;
        doc["use_radar"] = config.use_radar;
        
        // Pin assignments
        doc["pins"]["dht11"] = DHT_PIN;
        doc["pins"]["pir"] = PIR_PIN;
        doc["pins"]["led"] = LED_PIN;
        doc["pins"]["sda"] = SDA_PIN;
        doc["pins"]["scl"] = SCL_PIN;
        
        // System information
        doc["system"]["device_hostname"] = deviceHostname; // Use MDNS.hostname() for the actual hostname
        doc["system"]["wifi_ssid"] = WIFI_SSID;
        doc["system"]["wifi_password"] = WIFI_PASSWORD;
        doc["system"]["ap_ip"] = AP_IP;
        
        // Timing configuration
        doc["timing"]["sensor_read_interval"] = SENSOR_READ_INTERVAL;
        doc["timing"]["mqtt_publish_interval"] = MQTT_PUBLISH_INTERVAL;
        doc["timing"]["pir_cooldown"] = PIR_COOLDOWN;
        doc["timing"]["ota_check_interval"] = OTA_CHECK_INTERVAL;
        
        // MQTT topics
        doc["mqtt_topics"]["temperature"] = MQTT_TOPIC_TEMPERATURE;
        doc["mqtt_topics"]["humidity"] = MQTT_TOPIC_HUMIDITY;
        doc["mqtt_topics"]["motion"] = MQTT_TOPIC_MOTION;
        doc["mqtt_topics"]["luminescence"] = MQTT_TOPIC_LUMINESCENCE;
        doc["mqtt_topics"]["status"] = MQTT_TOPIC_STATUS;
        doc["mqtt_topics"]["all"] = MQTT_TOPIC_ALL;
        
