veryaner/esp8266-multi-sensor/src/web/webserver.cpp
        server.send(200, "application/json", response); });

    // Relay API endpoints
    server.on("/api/relay", HTTP_GET, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        DynamicJsonDocument doc(128);
        doc["state"] = getRelayState();
        doc["pin"] = getRelayPin();
        
        String response;
        serializeJson(doc, response);
        
        server.send(200, "application/json", response); });

    server.on("/api/relay", HTTP_POST, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        String body = server.arg("plain");
        DynamicJsonDocument doc(128);
        deserializeJson(doc, body);
        
        bool newState = false;
        
        if (doc.containsKey("state")) {
            newState = doc["state"];
            setRelayState(newState);
        } else {
            // Toggle if no state specified
            newState = !getRelayState();
            setRelayState(newState);
        }
        
        DynamicJsonDocument responseDoc(128);
        responseDoc["state"] = newState;
        responseDoc["pin"] = getRelayPin();
        responseDoc["message"] = newState ? "Relay turned ON" : "Relay turned OFF";
        
        String response;
        serializeJson(responseDoc, response);
        
        server.send(200, "application/json", response); });

    server.begin();
    WEB_DEBUG_PRINTLN("Web server started");
    MEMORY_DEBUG_PRINTF("Free heap after web server setup: %d bytes\n", ESP.getFreeHeap());

    // Debug: List all registered endpoints
    WEB_DEBUG_PRINTLN("Registered endpoints:");
    WEB_DEBUG_PRINTLN("- GET /");
    WEB_DEBUG_PRINTLN("- GET /api/sensors");
    WEB_DEBUG_PRINTLN("- GET /api/config");
    WEB_DEBUG_PRINTLN("- GET /health");
    WEB_DEBUG_PRINTLN("- GET /test");
    WEB_DEBUG_PRINTLN("- GET /simple");
    WEB_DEBUG_PRINTLN("- POST /api/restart");
    WEB_DEBUG_PRINTLN("- POST /api/wifi/reset");
    WEB_DEBUG_PRINTLN("- POST /api/sensors/reset");
}